Tekla Open API Reference for Tekla Structures 2025
Vector.Dot Method (Vector, Vector)
 Returns a dot product of the given two vectors.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static double Dot(
	Vector Vector1,
	Vector Vector2
)
Public Shared Function Dot (
	Vector1 As Vector,
	Vector2 As Vector
) As Double
Parameters
Vector1
Type: Tekla.Structures.Geometry3d.Vector
The first vector to be used.
Vector2
Type: Tekla.Structures.Geometry3d.Vector
The second vector to be used.
Return Value
Type: Double
The dot product of the vectors.
See Also
Reference
Vector Class
Dot Overload
Tekla.Structures.Geometry3d Namespace